Old-backend/app/controllers/shoes_controller.rb

    def index
        shoes = Shoe.all
---
SELECT "shoes".* FROM "shoes"

    def show
        shoe = Shoe.find_by(id: params[:id])
---
SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]