GTFS-backend-api/app/controllers/shoes_controller.rb

SELECT "shoes".* FROM "shoes"
---
    def index
        shoes = Shoe.all

SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        shoe = Shoe.find_by(id: params[:id])