GTFS-backend-api/app/controllers/shopping_carts_controller.rb

SELECT "shopping_carts".* FROM "shopping_carts"
---
    def index
        shopping_carts = ShoppingCart.all

SELECT "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        shopping_cart = ShoppingCart.find_by(id: params[:id])