GTFS-backend-api/app/controllers/shopping_cart_shoes_controller.rb

SELECT "shopping_cart_shoes".* FROM "shopping_cart_shoes"
---
    def index
        shopping_cart_shoes = ShoppingCartShoe.all

SELECT "shopping_cart_shoes".* FROM "shopping_cart_shoes" WHERE "shopping_cart_shoes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        shopping_cart_shoe = ShoppingCartShoe.find_by(id: params[:id])