GTFS-backend-api/app/controllers/users_controller.rb

    def index
        users = User.all
        users.each {|user| puts user.comments}
---
SELECT "users".* FROM "users"
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]

    def update
        user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE (1) LIMIT ?  [["LIMIT", 1]]